public class bitoperator {

	public static void main (String[] args) {

		int a = 1>>2;
		int b = -1>>2;//算数右移
		int c = 1<<2;
		int d = -1<<2;
		int e = 3>>>2;//无符号右移
		System.out.println("a=" + a);
		System.out.println("b=" + b); 
		System.out.println("c=" + c);
		System.out.println("d=" + d);
		System.out.println("e=" + e);
		System.out.println(2&3);
		//1.-2的原码10000000 00000000 00000000 00000010
		//2.-2的反码11111111 11111111 11111111 11111101
		//3.-2的补码11111111 11111111 11111111 11111110
		//4.~-2操作 00000000 00000000 00000000 00000001//运算后的补码为正
		System.out.println(~-2);//1
		//1.-2的原码00000000 00000000 00000000 00000010
		//2.-2的反码00000000 00000000 00000000 00000010
		//3.-2的补码00000000 00000000 00000000 00000010
		//4.~-2操作 11111111 11111111 11111111 11111101//运算后的补码为负，要推回原码
		//5.运算后的反码 11111111 11111111 11111111 11111100
		//6.运算后的原码 10000000 00000000 00000000 00000011 
		System.out.println(~ 2);//-3
		System.out.println(2 | 3);
		System.out.println(2 ^ 3);
	}
}